Revit 2021.1 API
RevisionSettings.SetAlphanumericRevisionSettings Method
 Replaces the current alphanumeric revision numbering settings with the specified AlphanumericRevisionSettings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
Since: 2016
Syntax
C#
public void SetAlphanumericRevisionSettings(
	AlphanumericRevisionSettings newSettings
)
Visual Basic
Public Sub SetAlphanumericRevisionSettings ( _
	newSettings As AlphanumericRevisionSettings _
)
Visual C++
public:
void SetAlphanumericRevisionSettings(
	AlphanumericRevisionSettings^ newSettings
)
Parameters
newSettings
Type: Autodesk.Revit.DB.AlphanumericRevisionSettings
 The specified AlphanumericRevisionSettings to be applied to alphanumeric revision numbering.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  newSettings is not a valid AlphanumericRevisionSettings.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
RevisionSettings Class
Autodesk.Revit.DB Namespace